# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.
# 4 -> 1 2 3 4
# 9

bushes = {
    1: 12,
    2: 4,
    3: 5,
    4: 9,
    5: 7,
    6: 12,
    7: 11,
    8: 2,
    9: 4
}
temp1 = list(bushes.values())
temp2 = list(bushes.values())
temp3 = list(bushes.values())
for j in range(0, 1):
    for i in range(len(temp1) - 1):
        temp = temp1[i]
        temp1[i] = temp1[i + 1]
        temp1[i + 1] = temp
        
for j in range(0, len(temp2) - 1):
    for i in range(len(temp2) - 1):
        temp = temp2[i]
        temp2[i] = temp2[i + 1]
        temp2[i + 1] = temp

for i in range(len(temp3)):
    temp3[i] += temp1[i] + temp2[i]

print(max(temp3))